{
    "quotes": [
        "'Be the webdev'",
        "don't worry we'll mostly just be building all term long!",
        "if you are a senior looking for an easy spring class, we might not work out, its not you its me, i just want you to love learning",
        "This course is like a firehose, fine maybe it is a little intense but builds character",
        "science has shown that watching kitten gifs improves health",
        "we'll be sending each other lots of internets this term",
        "the internet is made of layers. Like parfait",
        "btw don't worry about memorizing any of the little details",
        "lets not get carried away with analogies",
        "for this class... ONLY CHROME WILL DO",
        "everybody wants your data",
        "CSS will be friend and foe this term",
        "Certain things will be easy, certain things will feel impossible - but together we will prevail",
        "css inside joke: Try to vertically center something",
        "so overwhelming time for a break",
        "cowhand coding just leads to manure code",
        "beg, borrow, steal color schemes",
        "i know i'm an amazing lecturer, everything just makes sense whenever i speak... but lets do put down questions on the sheets",
        "let it all wash over you, a meditative javascript rain",
        "JABBA the script haha",
        "if there is anything you remember today, its that you can pass functions around, that that is the js way",
        "i'm a fan of ternary - dumb python",
        "various other helpful things",
        "general confusion - don't worry",
        "Ask questions, learn good",
        "getting into deep waters now but we will survive",
        "Storing state the old way used to be super gross. slight exaggeration but still",
        "questions comments concerns?",
        "wait backup - we're still in frontend mode",
        "trees on trees on trees",
        "you are all jquery masters",
        "2 way data binding is like globals and sideffects. shit can get messed up",
        "drink the koolaid that is react and know that the river of data is clean",
        "Can’t touch [immutable data structures]",
        "learning is good for you - builds character",
        "i haz proof",
        "React to the rescue",
        "don't nest too far"
    ]
}
